[
  {
    "id": 1,
    "title": "Knowy App Backend",
    "description": "Served as a Backend Developer (Cloud Engineer) in the capstone project, responsible for designing and building RESTful APIs to support application functionality. Implemented secure and scalable backend architecture using cloud services, ensuring efficient data processing and seamless integration with the frontend system.",
    "tech": ["Express.js", "Flask", "JWT", "NoSQL", "Google Cloud Platform"],
    "image": "/knowy.jpg?height=400&width=600",
    "featured": true
  },
  {
    "id": 2,
    "title": "Website JWPKu",
    "description": "Completed a BNSP-certified Junior Web Programmer course, developing a dynamic online shop website with standard features such as CRUD operations, user authentication, and product management. Focused on implementing clean code practices and responsive design to deliver a functional and user-friendly web application.",
    "tech": ["Laravel", "Bootstrap", "Tailwind", "MySQL"],
    "image": "/WebsiteJWPku.png?height=400&width=600",
    "featured": true
  },
  {
    "id": 3,
    "title": "PetCare Website",
    "description": "I once worked on a university project that involved setting up a small company and offering web development services to real clients. My team and I developed a Service management website that allows users to efficiently manage and update their Services through a dynamic, user-friendly interface.",
    "tech": ["PHP", "MySQL", "Tailwind"],
    "image": "/pet.png?height=400&width=600",
    "featured": true
  },
  {
    "id": 4,
    "title": "Humidity and temperature APP",
    "description": "I developed a mobile application to detect soil and air humidity as part of my thesis project. I built a machine learning model using the Internet of Things to accurately classify temperature and humidity. This trained model was integrated into a mobile application for real-world use.",
    "tech": ["Flutter", "Flask", "Google Playstore"],
    "image": "/sensor.png?height=400&width=600",
    "featured": true
  }
]
